zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_xspi.c
/*
 * Copyright (c) 2024 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * **************************************************************************
 * xSPI flash controller driver for stm32 series with xSPI periherals
 * This driver is based on the stm32Cube HAL XSPI driver
 * with one xspi DTS NODE
 * **************************************************************************
 *
 * CRITICAL CONSTRAINT: Avoid Flash Access in XIP Critical Path
 * **************************************************************************
 *
 * When CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION is enabled, driver code may
 * execute from RAM while the external XSPI flash is NOT in memory-mapped
 * mode. During these critical sections, the code MUST NOT access flash
 * memory to read driver data or configuration structures.
 *
 * Code Patterns to Maintain this Constraint:
 *
 * 1. FETCH CONFIG VALUES BEFORE THE CRITICAL PATH:
 *    - Read dev_cfg, dev_data, mode, rate before entering critical section
 *    - Pass them as function parameters; do not pass dev and dereference inside
 *    - Example: stm32_xspi_mem_ready(dev_data, mode, rate)
 *              NOT stm32_xspi_mem_ready(dev, mode, rate)
 *
 * 2. AVOID IMPLICIT STRUCTURE INITIALIZATION:
 *    - Initialize every structure field explicitly in the critical path.
 *    - Do not use aggregate initializers that may generate implicit memset
 *      calls accessing flash memory.
 *
 * 3. SUPPRESS LOGGING in XIP_RELOCATE mode to avoid any unintended flash access
 *
 * DO NOT modify these patterns without ensuring no flash accesses occur
 * during code execution from RAM in the critical path.
 */
#define DT_DRV_COMPAT st_stm32_xspi_nor

#if defined(CONFIG_SOC_SERIES_STM32H5X)
#warning "This driver will be deprecated in favor of its MSPI alternative following v4.5.0"
#endif /* CONFIG_SOC_SERIES_STM32H5X */

#include <errno.h>
#include <zephyr/kernel.h>
#include <soc.h>
#include <stm32_bitops.h>
#include <zephyr/cache.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/dt-bindings/flash_controller/xspi.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/irq.h>

#include "spi_nor.h"
#include "jesd216.h"

#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(flash_stm32_xspi, CONFIG_FLASH_LOG_LEVEL);

/* Keep log callsites in the driver, but silence them when relocation mode is enabled */
#if defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
#define XSPI_LOG_DBG(...)
#define XSPI_LOG_INF(...)
#define XSPI_LOG_WRN(...)
#define XSPI_LOG_ERR(...)
#else
#define XSPI_LOG_DBG(...) LOG_DBG(__VA_ARGS__)
#define XSPI_LOG_INF(...) LOG_INF(__VA_ARGS__)
#define XSPI_LOG_WRN(...) LOG_WRN(__VA_ARGS__)
#define XSPI_LOG_ERR(...) LOG_ERR(__VA_ARGS__)
#endif /* CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

#define STM32_XSPI_NODE(inst) DT_INST_PARENT(inst)

#define STM32_XSPI_RESET_GPIO DT_ANY_INST_HAS_PROP_STATUS_OKAY(reset_gpios)

#ifdef CONFIG_FLASH_STM32_XSPI_DMA
#include <zephyr/drivers/dma/dma_stm32.h>
#include <zephyr/drivers/dma.h>
#include <stm32_ll_dma.h>
#endif /* CONFIG_FLASH_STM32_XSPI_DMA */

#if defined(CONFIG_SOC_SERIES_STM32H7RSX)
#include <stm32_ll_pwr.h>
#include <stm32_ll_system.h>
#endif /* CONFIG_SOC_SERIES_STM32H7RSX */

#include "flash_stm32_xspi.h"

static void stm32_xspi_bzero(void *destination, size_t size)
{
	volatile uint8_t *destination_ptr = destination;

	while (size > 0U) {
		*destination_ptr = 0U;
		destination_ptr++;
		size--;
	}
}

static inline void xspi_lock_thread(const struct device *dev)
{
	struct flash_stm32_xspi_data *dev_data = dev->data;

	k_sem_take(&dev_data->sem, K_FOREVER);
}

static inline void xspi_unlock_thread(const struct device *dev)
{
	struct flash_stm32_xspi_data *dev_data = dev->data;

	k_sem_give(&dev_data->sem);
}

static int xspi_send_cmd(struct flash_stm32_xspi_data *dev_data,
			 XSPI_RegularCmdTypeDef *cmd)
{
	HAL_StatusTypeDef hal_ret;

	XSPI_LOG_DBG("Instruction 0x%x", cmd->Instruction);

	dev_data->cmd_status = 0;

	hal_ret = HAL_XSPI_Command(&dev_data->hxspi, cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		XSPI_LOG_ERR("%d: Failed to send XSPI instruction", hal_ret);
		return -EIO;
	}
	XSPI_LOG_DBG("CCR 0x%x", dev_data->hxspi.Instance->CCR);

	return dev_data->cmd_status;
}

static int xspi_read_access(const struct device *dev, XSPI_RegularCmdTypeDef *cmd,
			    uint8_t *data, const size_t size)
{
	struct flash_stm32_xspi_data *dev_data = dev->data;
	HAL_StatusTypeDef hal_ret;

	LOG_DBG("Instruction 0x%x", cmd->Instruction);

	cmd->DataLength = size;

	dev_data->cmd_status = 0;

	hal_ret = HAL_XSPI_Command(&dev_data->hxspi, cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to send XSPI instruction", hal_ret);
		return -EIO;
	}

#ifdef CONFIG_FLASH_STM32_XSPI_DMA
	hal_ret = HAL_XSPI_Receive_DMA(&dev_data->hxspi, data);
#else
	hal_ret = HAL_XSPI_Receive_IT(&dev_data->hxspi, data);
#endif

	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to read data", hal_ret);
		return -EIO;
	}

	k_sem_take(&dev_data->sync, K_FOREVER);

	return dev_data->cmd_status;
}

static int xspi_write_access(struct flash_stm32_xspi_data *dev_data,
			     uint8_t data_mode,
			     XSPI_RegularCmdTypeDef *cmd,
			     const uint8_t *data, const size_t size)
{
	HAL_StatusTypeDef hal_ret;

	XSPI_LOG_DBG("Instruction 0x%x", cmd->Instruction);

	cmd->DataLength = size;
	dev_data->cmd_status = 0;

	/* in OPI/STR the 3-byte AddressWidth is not supported by the NOR flash */
	if ((data_mode == XSPI_OCTO_MODE) &&
		(cmd->AddressWidth != HAL_XSPI_ADDRESS_32_BITS)) {
		XSPI_LOG_ERR("XSPI wr in OPI/STR mode is for 32bit address only");
		return -EIO;
	}

	hal_ret = HAL_XSPI_Command(&dev_data->hxspi, cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		XSPI_LOG_ERR("%d: Failed to send XSPI instruction", hal_ret);
		return -EIO;
	}

#if defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	/* Use blocking transmit - IRQs are locked while memmap is off */
	hal_ret = HAL_XSPI_Transmit(&dev_data->hxspi, (uint8_t *)data,
				    HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
#elif defined(CONFIG_FLASH_STM32_XSPI_DMA)
	hal_ret = HAL_XSPI_Transmit_DMA(&dev_data->hxspi, (uint8_t *)data);
#else /* !CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION && !CONFIG_FLASH_STM32_XSPI_DMA */
	hal_ret = HAL_XSPI_Transmit_IT(&dev_data->hxspi, (uint8_t *)data);
#endif /* CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

	if (hal_ret != HAL_OK) {
		XSPI_LOG_ERR("%d: Failed to write data", hal_ret);
		return -EIO;
	}

#if !defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	k_sem_take(&dev_data->sync, K_FOREVER);
#endif /* !CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */
	return dev_data->cmd_status;
}

