zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_xspi.c
/*
 * Gives a XSPI_RegularCmdTypeDef with all parameters set
 * except Instruction, Address, DummyCycles, NbData
 */
static void xspi_prepare_cmd(XSPI_RegularCmdTypeDef *cmd_tmp,
				 const uint8_t transfer_mode,
				 const uint8_t transfer_rate)
{
	stm32_xspi_bzero(cmd_tmp, sizeof(*cmd_tmp));

	cmd_tmp->OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
	cmd_tmp->InstructionWidth = ((transfer_mode == XSPI_OCTO_MODE)
			? HAL_XSPI_INSTRUCTION_16_BITS
			: HAL_XSPI_INSTRUCTION_8_BITS);
	cmd_tmp->InstructionDTRMode = ((transfer_rate == XSPI_DTR_TRANSFER)
			? HAL_XSPI_INSTRUCTION_DTR_ENABLE
			: HAL_XSPI_INSTRUCTION_DTR_DISABLE);
	cmd_tmp->AddressDTRMode = ((transfer_rate == XSPI_DTR_TRANSFER)
			? HAL_XSPI_ADDRESS_DTR_ENABLE
			: HAL_XSPI_ADDRESS_DTR_DISABLE);
	/* AddressWidth must be set to 32bits for init and mem config phase */
	cmd_tmp->AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
	cmd_tmp->AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
	cmd_tmp->DataDTRMode = ((transfer_rate == XSPI_DTR_TRANSFER)
			? HAL_XSPI_DATA_DTR_ENABLE
			: HAL_XSPI_DATA_DTR_DISABLE);
	cmd_tmp->DQSMode = (transfer_rate == XSPI_DTR_TRANSFER)
			? HAL_XSPI_DQS_ENABLE
			: HAL_XSPI_DQS_DISABLE;
#ifdef XSPI_CCR_SIOO
	cmd_tmp->SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;
#endif /* XSPI_CCR_SIOO */

	switch (transfer_mode) {
	case XSPI_OCTO_MODE: {
		cmd_tmp->InstructionMode = HAL_XSPI_INSTRUCTION_8_LINES;
		cmd_tmp->AddressMode = HAL_XSPI_ADDRESS_8_LINES;
		cmd_tmp->DataMode = HAL_XSPI_DATA_8_LINES;
		break;
	}
	case XSPI_QUAD_MODE: {
		cmd_tmp->InstructionMode = HAL_XSPI_INSTRUCTION_4_LINES;
		cmd_tmp->AddressMode = HAL_XSPI_ADDRESS_4_LINES;
		cmd_tmp->DataMode = HAL_XSPI_DATA_4_LINES;
		break;
	}
	case XSPI_DUAL_MODE: {
		cmd_tmp->InstructionMode = HAL_XSPI_INSTRUCTION_2_LINES;
		cmd_tmp->AddressMode = HAL_XSPI_ADDRESS_2_LINES;
		cmd_tmp->DataMode = HAL_XSPI_DATA_2_LINES;
		break;
	}
	default: {
		cmd_tmp->InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd_tmp->AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd_tmp->DataMode = HAL_XSPI_DATA_1_LINE;
		break;
	}
	}

}

static uint32_t stm32_xspi_hal_address_size(const struct flash_stm32_xspi_data *dev_data)
{
	if (dev_data->address_width == 4U) {
		return HAL_XSPI_ADDRESS_32_BITS;
	}

	return HAL_XSPI_ADDRESS_24_BITS;
}

#if defined(CONFIG_FLASH_JESD216_API)
/*
 * Read the JEDEC ID data from the external Flash at init
 * and store in the jedec_id Table of the flash_stm32_xspi_data
 * The JEDEC ID is not given by a DTS property
 */
static int stm32_xspi_read_jedec_id(const struct device *dev)
{
	struct flash_stm32_xspi_data *dev_data = dev->data;

	/* This is a SPI/STR command to issue to the external Flash device */
	XSPI_RegularCmdTypeDef cmd;

	xspi_prepare_cmd(&cmd, XSPI_SPI_MODE, XSPI_STR_TRANSFER);

	cmd.Instruction = JESD216_CMD_READ_ID;
	cmd.AddressWidth = stm32_xspi_hal_address_size(dev_data);
	cmd.AddressMode = HAL_XSPI_ADDRESS_NONE;
	cmd.DataLength = JESD216_READ_ID_LEN; /* 3 bytes in the READ ID */

	HAL_StatusTypeDef hal_ret;

	hal_ret = HAL_XSPI_Command(&dev_data->hxspi, &cmd,
				   HAL_XSPI_TIMEOUT_DEFAULT_VALUE);

	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to send XSPI instruction", hal_ret);
		return -EIO;
	}

	/* Place the received data directly into the jedec Table */
	hal_ret = HAL_XSPI_Receive(&dev_data->hxspi, dev_data->jedec_id,
				   HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to read data", hal_ret);
		return -EIO;
	}

	LOG_DBG("Jedec ID = [%02x %02x %02x]",
		dev_data->jedec_id[0], dev_data->jedec_id[1], dev_data->jedec_id[2]);

	dev_data->cmd_status = 0;

	return 0;
}

/*
 * Read Serial Flash ID :
 * just gives the values received by the external Flash
 */
static int xspi_read_jedec_id(const struct device *dev,  uint8_t *id)
{
	struct flash_stm32_xspi_data *dev_data = dev->data;

	/* Take jedec Id values from the table (issued from the octoFlash) */
	memcpy(id, dev_data->jedec_id, JESD216_READ_ID_LEN);

	LOG_INF("Manuf ID = %02x   Memory Type = %02x   Memory Density = %02x",
		id[0], id[1], id[2]);

	return 0;
}
#endif /* CONFIG_FLASH_JESD216_API */

/*
 * Read Serial Flash Discovery Parameter from the external Flash at init :
 * perform a read access over SPI bus for SDFP (DataMode is already set)
 * The SFDP table is not given by a DTS property
 */
static int stm32_xspi_read_sfdp(const struct device *dev, off_t addr,
				void *data,
				size_t size)
{
	const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	struct flash_stm32_xspi_data *dev_data = dev->data;
	XSPI_RegularCmdTypeDef cmd;

	xspi_prepare_cmd(&cmd, dev_cfg->data_mode, dev_cfg->data_rate);

	if (dev_cfg->data_mode == XSPI_OCTO_MODE) {
		cmd.Instruction = JESD216_OCMD_READ_SFDP;
		cmd.DummyCycles = 20U;
		cmd.AddressWidth = HAL_XSPI_ADDRESS_32_BITS;
	} else {
		cmd.Instruction = JESD216_CMD_READ_SFDP;
		cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
		cmd.DataMode = HAL_XSPI_DATA_1_LINE;
		cmd.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
		cmd.DummyCycles = 8U;
		cmd.AddressWidth = HAL_XSPI_ADDRESS_24_BITS;
	}
	cmd.Address = addr;
	cmd.DataLength = size;

	HAL_StatusTypeDef hal_ret;

	hal_ret = HAL_XSPI_Command(&dev_data->hxspi, &cmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to send XSPI instruction", hal_ret);
		return -EIO;
	}

	hal_ret = HAL_XSPI_Receive(&dev_data->hxspi, (uint8_t *)data,
				   HAL_XSPI_TIMEOUT_DEFAULT_VALUE);
	if (hal_ret != HAL_OK) {
		LOG_ERR("%d: Failed to read data", hal_ret);
		return -EIO;
	}

	dev_data->cmd_status = 0;

	return 0;
}

/*
 * Read Serial Flash Discovery Parameter :
 * perform a read access over SPI bus for SDFP (DataMode is already set)
 */
static int xspi_read_sfdp(const struct device *dev, off_t addr, void *data,
			  size_t size)
{
	LOG_INF("Read SFDP from externalFlash");
	/* Get the SFDP from the external Flash (no sfdp-bfp table in the DeviceTree) */
	if (stm32_xspi_read_sfdp(dev, addr, data, size) == 0) {
		/* If valid, then ignore any table from the DTS */
		return 0;
	}
	LOG_INF("Error reading SFDP from external Flash and none in the DTS");
	return -EINVAL;
}

static bool xspi_address_is_valid(const struct device *dev, off_t addr,
				  size_t size)
{
	const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	size_t flash_size = dev_cfg->flash_size;

	return (addr >= 0) && ((uint64_t)addr + (uint64_t)size <= flash_size);
}

static int stm32_xspi_wait_auto_polling(struct flash_stm32_xspi_data *dev_data,
		XSPI_AutoPollingTypeDef *s_config, uint32_t timeout_ms)
{
	dev_data->cmd_status = 0;

#if defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	/* Use blocking polling - IRQs are locked while memmap is off */
	if (HAL_XSPI_AutoPolling(&dev_data->hxspi, s_config, timeout_ms) != HAL_OK) {
		return -EIO;
	}
	return dev_data->cmd_status;
#else
	if (HAL_XSPI_AutoPolling_IT(&dev_data->hxspi, s_config) != HAL_OK) {
		XSPI_LOG_ERR("XSPI AutoPoll failed");
		return -EIO;
	}

