zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_xspi.c
	return 0;
}

/* Function to return true if the octoflash is in MemoryMapped else false */
static bool stm32_xspi_is_memorymap(struct flash_stm32_xspi_data *dev_data)
{
	return stm32_reg_read_bits(&dev_data->hxspi.Instance->CR, XSPI_CR_FMODE) == XSPI_CR_FMODE;
}

static void stm32_xspi_invalidate_mmap_cache(const struct device *dev, off_t addr, size_t size)
{
	const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	size_t line_size = sys_cache_data_line_size_get();

	if (line_size != 0 && IS_ENABLED(CONFIG_DCACHE) &&
	    IS_ENABLED(CONFIG_FLASH_STM32_NOR_MEMMAP) &&
	    IS_ENABLED(CONFIG_CACHE_MANAGEMENT)) {
		uintptr_t start = ROUND_DOWN(dev_cfg->mem_map_based_address + addr, line_size);
		uintptr_t end = ROUND_UP(dev_cfg->mem_map_based_address + addr + size, line_size);

		sys_cache_data_invd_range((void *)start, end - start);
	}
}

/*
 * Function to erase the flash : chip or sector with possible OCTO/SPI and STR/DTR
 * to erase the complete chip (using dedicated command) :
 *   set size >= flash size
 *   set addr = 0
 */
static int flash_stm32_xspi_erase(const struct device *dev, off_t addr,
				  size_t size)
{
	const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	struct flash_stm32_xspi_data *dev_data = dev->data;
	const size_t flash_size = dev_cfg->flash_size;
	const uint8_t data_mode = dev_cfg->data_mode;
	const uint8_t data_rate = dev_cfg->data_rate;
	int ret = 0;

	/* Ignore zero size erase */
	if (size == 0) {
		return 0;
	}

	/* Maximise erase size : means the complete chip */
	if (size > flash_size) {
		size = flash_size;
	}

	if (!xspi_address_is_valid(dev, addr, size)) {
		LOG_ERR("Error: address or size exceeds expected values: "
			"addr 0x%lx, size %zu", (long)addr, size);
		return -EINVAL;
	}

	if (((size % SPI_NOR_SECTOR_SIZE) != 0) && (size < dev_cfg->flash_size)) {
		LOG_ERR("Error: wrong sector size 0x%x", size);
		return -ENOTSUP;
	}

	XSPI_RegularCmdTypeDef cmd_erase;

	stm32_xspi_bzero(&cmd_erase, sizeof(cmd_erase));

	compiler_barrier();

	const off_t erase_addr = addr;
	const size_t erase_size = size;

	xspi_lock_thread(dev);

#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	bool was_memmap = false;
	unsigned int irq_key = 0;
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

	cmd_erase.OperationType = HAL_XSPI_OPTYPE_COMMON_CFG;
	cmd_erase.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
	cmd_erase.DataMode = HAL_XSPI_DATA_NONE;
	cmd_erase.DummyCycles = 0U;
	cmd_erase.DQSMode = HAL_XSPI_DQS_DISABLE;
#ifdef XSPI_CCR_SIOO
	cmd_erase.SIOOMode = HAL_XSPI_SIOO_INST_EVERY_CMD;
#endif /* XSPI_CCR_SIOO */

	cmd_erase.InstructionMode    = (data_mode == XSPI_OCTO_MODE)
					? HAL_XSPI_INSTRUCTION_8_LINES
					: HAL_XSPI_INSTRUCTION_1_LINE;
	cmd_erase.InstructionDTRMode = (data_rate == XSPI_DTR_TRANSFER)
					? HAL_XSPI_INSTRUCTION_DTR_ENABLE
					: HAL_XSPI_INSTRUCTION_DTR_DISABLE;
	cmd_erase.InstructionWidth    = (data_mode == XSPI_OCTO_MODE)
					? HAL_XSPI_INSTRUCTION_16_BITS
					: HAL_XSPI_INSTRUCTION_8_BITS;

	while ((size > 0) && (ret == 0)) {

#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
		if (stm32_xspi_is_memorymap(dev_data)) {
			was_memmap = true;

			if (IS_ENABLED(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)) {
				/* Lock IRQs for one erase operation */
				irq_key = irq_lock();
			}

			/* Abort ongoing transfer to force CS high/BUSY deasserted */
			ret = stm32_xspi_abort(dev);
			if (ret != 0) {
				XSPI_LOG_ERR("Failed to abort memory-mapped access before erase");
				goto erase_chunk_end;
			}
		}
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

		if (stm32_xspi_mem_ready(dev_data, data_mode, data_rate) != 0) {
			XSPI_LOG_ERR("Erase failed : flash busy");
			ret = -EIO;
			goto erase_chunk_end;
		}

		ret = stm32_xspi_write_enable(dev_data, data_mode, data_rate);
		if (ret != 0) {
			XSPI_LOG_ERR("Erase failed : write enable");
			goto erase_chunk_end;
		}

		if (size == flash_size) {
			/* Chip erase */
			XSPI_LOG_DBG("Chip Erase");

			cmd_erase.Address = 0;
			cmd_erase.Instruction = (data_mode == XSPI_OCTO_MODE)
					? SPI_NOR_OCMD_BULKE
					: SPI_NOR_CMD_BULKE;
			cmd_erase.AddressMode = HAL_XSPI_ADDRESS_NONE;
			/* Full chip erase (Bulk) command */
			xspi_send_cmd(dev_data, &cmd_erase);

			size -= flash_size;
			/* Chip (Bulk) erase started, wait until WEL becomes 0 */
			ret = stm32_xspi_mem_erased(dev_data, data_mode, data_rate);
			if (ret != 0) {
				XSPI_LOG_ERR("Chip Erase failed");
				goto erase_chunk_end;
			}
		} else {
			/* Sector or Block erase depending on the size */
			XSPI_LOG_DBG("Sector/Block Erase");

			cmd_erase.AddressMode =
				(data_mode == XSPI_OCTO_MODE)
				? HAL_XSPI_ADDRESS_8_LINES
				: HAL_XSPI_ADDRESS_1_LINE;
			cmd_erase.AddressDTRMode =
				(data_rate == XSPI_DTR_TRANSFER)
				? HAL_XSPI_ADDRESS_DTR_ENABLE
				: HAL_XSPI_ADDRESS_DTR_DISABLE;
			cmd_erase.AddressWidth = stm32_xspi_hal_address_size(dev_data);
			cmd_erase.Address = addr;

			const struct jesd216_erase_type *erase_types =
							dev_data->erase_types;
			const struct jesd216_erase_type *bet = NULL;

			for (uint8_t ei = 0;
				ei < JESD216_NUM_ERASE_TYPES; ++ei) {
				const struct jesd216_erase_type *etp =
							&erase_types[ei];

				if ((etp->exp != 0)
				    && SPI_NOR_IS_ALIGNED(addr, etp->exp)
				    && (size >= BIT(etp->exp))
				    && ((bet == NULL)
					|| (etp->exp > bet->exp))) {
					bet = etp;
					cmd_erase.Instruction = bet->cmd;
				} else if (bet == NULL) {
					/* Use the default sector erase cmd */
					if (data_mode == XSPI_OCTO_MODE) {
						cmd_erase.Instruction = SPI_NOR_OCMD_SE;
					} else {
						cmd_erase.Instruction =
							(stm32_xspi_hal_address_size(dev_data) ==
							HAL_XSPI_ADDRESS_32_BITS)
							? SPI_NOR_CMD_SE_4B
							: SPI_NOR_CMD_SE;
					}
				}
				/* Avoid using wrong erase type,
				 * if zero entries are found in erase_types
				 */
				bet = NULL;
			}
			XSPI_LOG_DBG("Sector/Block Erase addr 0x%x, asize 0x%x "
				     "amode 0x%x instr 0x%x",
				     cmd_erase.Address, cmd_erase.AddressWidth,
				     cmd_erase.AddressMode, cmd_erase.Instruction);

			xspi_send_cmd(dev_data, &cmd_erase);

			if (bet != NULL) {
				addr += BIT(bet->exp);
				size -= BIT(bet->exp);
			} else {
				addr += SPI_NOR_SECTOR_SIZE;
				size -= SPI_NOR_SECTOR_SIZE;
			}

			ret = stm32_xspi_mem_ready(dev_data, data_mode, data_rate);
		}

