zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_xspi.c
erase_chunk_end:
#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
		if (was_memmap) {
			if (stm32_xspi_set_memorymap(dev_data, data_mode, data_rate) != 0) {
				/* Failed to restore memory map mode */
				while (1) {
					/* Infinite loop to prevent further execution */
				}
			}

			was_memmap = false;

			if (IS_ENABLED(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)) {
				irq_unlock(irq_key);
			}
		}
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */
		continue;
	}

	stm32_xspi_invalidate_mmap_cache(dev, erase_addr, erase_size);

	xspi_unlock_thread(dev);

	return ret;
}

/* Function to read the flash with possible OCTO/SPI and STR/DTR */
static int flash_stm32_xspi_read(const struct device *dev, off_t addr,
				 void *data, size_t size)
{
	__maybe_unused const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	__maybe_unused struct flash_stm32_xspi_data *dev_data = dev->data;
	int ret = 0;

	if (!xspi_address_is_valid(dev, addr, size)) {
		LOG_ERR("Error: address or size exceeds expected values: "
			"addr 0x%lx, size %zu", (long)addr, size);
		return -EINVAL;
	}

	/* Ignore zero size read */
	if (size == 0) {
		return 0;
	}

#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || \
	(defined(CONFIG_STM32_APP_IN_EXT_FLASH) && defined(CONFIG_XIP)) || \
	defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	/*
	 * When the call is made by an app executing in external flash,
	 * skip the memory-mapped mode check
	 */
#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)

	/* Do reads through memory-mapping instead of indirect */
	if (!stm32_xspi_is_memorymap(dev_data)) {
		const uint8_t data_mode = dev_cfg->data_mode;
		const uint8_t data_rate = dev_cfg->data_rate;

		xspi_lock_thread(dev);
		ret = stm32_xspi_set_memorymap(dev_data, data_mode, data_rate);
		xspi_unlock_thread(dev);

		if (ret != 0) {
			LOG_ERR("READ: failed to set memory mapped");
			return ret;
		}
	}

	__ASSERT_NO_MSG(stm32_xspi_is_memorymap(dev_data));
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

	uintptr_t mmap_addr = dev_cfg->mem_map_based_address + addr;

	LOG_DBG("Memory-mapped read from 0x%08lx, len %zu", mmap_addr, size);
	memcpy(data, (void *)mmap_addr, size);
	return ret;

#else /* CONFIG_FLASH_STM32_NOR_MEMMAP || (CONFIG_STM32_APP_IN_EXT_FLASH && CONFIG_XIP)
       * || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION
       */

	XSPI_RegularCmdTypeDef cmd;

	xspi_prepare_cmd(&cmd, dev_cfg->data_mode, dev_cfg->data_rate);

	if (dev_cfg->data_mode != XSPI_OCTO_MODE) {
		switch (dev_data->read_mode) {
		case JESD216_MODE_112: {
			cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
			cmd.DataMode = HAL_XSPI_DATA_2_LINES;
			break;
		}
		case JESD216_MODE_122: {
			cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_XSPI_ADDRESS_2_LINES;
			cmd.DataMode = HAL_XSPI_DATA_2_LINES;
			break;
		}
		case JESD216_MODE_114: {
			cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
			cmd.DataMode = HAL_XSPI_DATA_4_LINES;
			break;
		}
		case JESD216_MODE_144: {
			cmd.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
			cmd.DataMode = HAL_XSPI_DATA_4_LINES;
			break;
		}
		default:
			/* use the mode from ospi_prepare_cmd */
			break;
		}
	}

	/* Instruction and DummyCycles are set below */
	cmd.Address = addr; /* AddressSize is 32bits in OPSI mode */
	cmd.AddressWidth = stm32_xspi_hal_address_size(dev_data);
	/* DataSize is set by the read cmd */

	/* Configure other parameters */
	if (dev_cfg->data_rate == XSPI_DTR_TRANSFER) {
		/* DTR transfer rate (==> Octal mode) */
		cmd.Instruction = SPI_NOR_OCMD_DTR_RD;
		cmd.DummyCycles = SPI_NOR_DUMMY_RD_OCTAL_DTR;
	} else {
		/* STR transfer rate */
		if (dev_cfg->data_mode == XSPI_OCTO_MODE) {
			/* OPI and STR */
			cmd.Instruction = SPI_NOR_OCMD_RD;
			cmd.DummyCycles = SPI_NOR_DUMMY_RD_OCTAL;
		} else {
			/* use SFDP:BFP read instruction */
			cmd.Instruction = dev_data->read_opcode;
			cmd.DummyCycles = dev_data->read_dummy;
			/* in SPI and STR : expecting SPI_NOR_CMD_READ_FAST_4B */
		}
	}

	LOG_DBG("XSPI: read %zu data at 0x%lx",
		size,
		(long)(dev_cfg->mem_map_based_address + addr));
	xspi_lock_thread(dev);

	ret = xspi_read_access(dev, &cmd, data, size);
	xspi_unlock_thread(dev);

	return ret;
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || (CONFIG_STM32_APP_IN_EXT_FLASH && CONFIG_XIP)
	* || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION
	*/
}

/* Function to write the flash (page program) : with possible OCTO/SPI and STR/DTR */
static int flash_stm32_xspi_write(const struct device *dev, off_t addr,
				  const void *data, size_t size)
{
	const struct flash_stm32_xspi_config *dev_cfg = dev->config;
	struct flash_stm32_xspi_data *dev_data = dev->data;
	const uint8_t data_mode = dev_cfg->data_mode;
	const uint8_t data_rate = dev_cfg->data_rate;
	size_t to_write;
	int ret = 0;

	if (!xspi_address_is_valid(dev, addr, size)) {
		LOG_ERR("Error: address or size exceeds expected values: "
			"addr 0x%lx, size %zu", (long)addr, size);
		return -EINVAL;
	}

	/* Ignore zero size write */
	if (size == 0) {
		return 0;
	}

	const off_t write_addr = addr;
	const size_t write_size = size;

	/* Build page-program command before entering XSPI critical section. */
	XSPI_RegularCmdTypeDef cmd_pp;

	xspi_prepare_cmd(&cmd_pp, data_mode, data_rate);

	compiler_barrier();

	xspi_lock_thread(dev);

#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
	bool was_memmap = false;
	unsigned int irq_key = 0;
#endif /* CONFIG_FLASH_STM32_NOR_MEMMAP || CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION */

	/* using 32bits address also in SPI/STR mode */
	cmd_pp.Instruction = dev_data->write_opcode;

	if (data_mode != XSPI_OCTO_MODE) {
		switch (cmd_pp.Instruction) {
		case SPI_NOR_CMD_PP_4B:
			__fallthrough;
		case SPI_NOR_CMD_PP: {
			cmd_pp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd_pp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
			cmd_pp.DataMode = HAL_XSPI_DATA_1_LINE;
			break;
		}
		case SPI_NOR_CMD_PP_1_1_4_4B:
			__fallthrough;
		case SPI_NOR_CMD_PP_1_1_4: {
			cmd_pp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd_pp.AddressMode = HAL_XSPI_ADDRESS_1_LINE;
			cmd_pp.DataMode = HAL_XSPI_DATA_4_LINES;
			break;
		}
		case SPI_NOR_CMD_PP_1_4_4_4B:
			__fallthrough;
		case SPI_NOR_CMD_PP_1_4_4: {
#if defined(CONFIG_USE_MICROCHIP_QSPI_FLASH_WITH_STM32)
			/* Microchip QSPI flash uses PP_1_1_4 opcode for the PP_1_4_4 operation */
			cmd_pp.Instruction = SPI_NOR_CMD_PP_1_1_4;
#endif /* CONFIG_USE_MICROCHIP_QSPI_FLASH_WITH_STM32 */
			cmd_pp.InstructionMode = HAL_XSPI_INSTRUCTION_1_LINE;
			cmd_pp.AddressMode = HAL_XSPI_ADDRESS_4_LINES;
			cmd_pp.DataMode = HAL_XSPI_DATA_4_LINES;
			break;
		}
		default:
			/* use the mode from ospi_prepare_cmd */
			break;
		}
	}

	cmd_pp.Address = addr;
	cmd_pp.AddressWidth = stm32_xspi_hal_address_size(dev_data);
	cmd_pp.DummyCycles = 0U;

	XSPI_LOG_DBG("XSPI: write %zu data at 0x%lx",
		size,
		(long)(dev_cfg->mem_map_based_address + addr));

	while ((size > 0) && (ret == 0)) {

#if defined(CONFIG_FLASH_STM32_NOR_MEMMAP) || defined(CONFIG_FLASH_STM32_XSPI_RAM_RELOCATION)
		if (stm32_xspi_is_memorymap(dev_data)) {
			was_memmap = true;

