zephyrproject-rtos/zephyr/drivers/flash/flash_stm32_xspi.c
#if defined(HAL_XSPIM_IOPORT_1) || defined(HAL_XSPIM_IOPORT_2)
#define DT_XSPI_STM32_MEMORY_SELECT(inst)				\
		.MemorySelect = ((DT_INST_PROP(inst, ncs_line) == 1)	\
					? HAL_XSPI_CSSEL_NCS1		\
					: HAL_XSPI_CSSEL_NCS2),
#else
#define DT_XSPI_STM32_MEMORY_SELECT(inst)	 /* Not used */
#endif /* HAL_XSPIM_IOPORT_1 || HAL_XSPIM_IOPORT_2 */

#if defined(XSPI_DCR1_DLYBYP)
#define DT_XSPI_STM32_DELAY_BLOCK_BYPASS(inst)						\
		.DelayBlockBypass = (DT_PROP(STM32_XSPI_NODE(inst), dlyb_bypass)	\
					? HAL_XSPI_DELAY_BLOCK_BYPASS			\
					: HAL_XSPI_DELAY_BLOCK_ON),
#else
#define DT_XSPI_STM32_DELAY_BLOCK_BYPASS(inst)	/* Not used */
#endif /* XSPI_DCR1_DLYBYP */

#if defined(XSPI_DCR3_MAXTRAN)
#define XSPI_STM32_MAXTRAN	\
		.MaxTran = 0,
#else
#define XSPI_STM32_MAXTRAN	 /* Not used */
#endif /* XSPI_DCR3_MAXTRAN */

#if defined(XSPI_DCR4_REFRESH)
#define XSPI_STM32_REFRESH	\
		.Refresh = 0,	 /* Not used */
#else
#define XSPI_STM32_REFRESH
#endif /* XSPI_DCR4_REFRESH */

#define XSPI_NOR_STM32_INIT(inst)								\
												\
	PINCTRL_DT_DEFINE(STM32_XSPI_NODE(inst));						\
												\
	static void flash_stm32_xspi_irq_config_func_##inst(const struct device *dev)		\
	{											\
		IRQ_CONNECT(DT_IRQN(STM32_XSPI_NODE(inst)),					\
			    DT_IRQ(STM32_XSPI_NODE(inst), priority),				\
			    flash_stm32_xspi_isr, DEVICE_DT_INST_GET(inst), 0);			\
		irq_enable(DT_IRQN(STM32_XSPI_NODE(inst)));					\
	}											\
												\
	static const struct flash_stm32_xspi_config flash_stm32_xspi_cfg_##inst = {		\
		/* Properties of the controller */						\
		.pclken = STM32_DT_CLOCK_INFO_BY_NAME(STM32_XSPI_NODE(inst), xspix),		\
		IF_ENABLED(DT_CLOCKS_HAS_NAME(STM32_XSPI_NODE(inst), xspi_ker),	(		\
			.has_pclken_ker = true,							\
			.pclken_ker = STM32_DT_CLOCK_INFO_BY_NAME(STM32_XSPI_NODE(inst), xspi_ker),\
		))										\
		.pcfg = PINCTRL_DT_DEV_CONFIG_GET(STM32_XSPI_NODE(inst)),			\
		.irq_config = flash_stm32_xspi_irq_config_func_##inst,				\
		.mem_map_based_address = DT_REG_ADDR_BY_IDX(STM32_XSPI_NODE(inst), 1),		\
												\
		/* Properties of the flash device */						\
		.flash_size = DT_INST_PROP(inst, size) / 8,			/* In Bytes */	\
		.max_frequency = DT_INST_PROP(inst, ospi_max_frequency),			\
		.data_mode = DT_INST_PROP(inst, spi_bus_width),			/* SPI or OPI */\
		.data_rate = DT_INST_PROP(inst, data_rate),			/* DTR or STR */\
		.four_byte_opcodes = DT_INST_PROP_OR(inst, four_byte_opcodes, 0),		\
		.requires_ulbpr = DT_INST_PROP_OR(inst, requires_ulbpr, 0),			\
		IF_ENABLED(DT_INST_NODE_HAS_PROP(inst, reset_gpios), (				\
			.reset = GPIO_DT_SPEC_INST_GET(0, reset_gpios),				\
			.reset_gpios_duration = DT_INST_PROP_OR(inst, reset_gpios_duration, 1),	\
		))										\
	};											\
												\
	static struct flash_stm32_xspi_data flash_stm32_xspi_dev_data_##inst = {		\
		.hxspi = {									\
			.Instance = (XSPI_TypeDef *)DT_REG_ADDR(STM32_XSPI_NODE(inst)),		\
			.Init = {								\
				.FifoThresholdByte = STM32_XSPI_FIFO_THRESHOLD,			\
				.SampleShifting = (DT_PROP(STM32_XSPI_NODE(inst), ssht_enable)	\
						? HAL_XSPI_SAMPLE_SHIFT_HALFCYCLE		\
						: HAL_XSPI_SAMPLE_SHIFT_NONE),			\
				.ChipSelectHighTimeCycle = 2,					\
				.ClockMode = HAL_XSPI_CLOCK_MODE_0,				\
				.ChipSelectBoundary = 0,					\
				.MemoryMode = HAL_XSPI_SINGLE_MEM,				\
				.FreeRunningClock = HAL_XSPI_FREERUNCLK_DISABLE,		\
				DT_XSPI_STM32_MEMORY_SELECT(inst)				\
				DT_XSPI_STM32_DELAY_BLOCK_BYPASS(inst)				\
				XSPI_STM32_MAXTRAN						\
				XSPI_STM32_REFRESH						\
			},									\
		},										\
												\
		.qer_type = DT_QER_PROP_OR(inst, JESD216_DW15_QER_VAL_S1B6),			\
		.write_opcode = DT_WRITEOC_PROP_OR(inst, SPI_NOR_WRITEOC_NONE),			\
		.page_size = SPI_NOR_PAGE_SIZE, /* by default, to be updated by sfdp */		\
		IF_ENABLED(DT_INST_NODE_HAS_PROP(inst, jedec_id), (			\
			IF_ENABLED(CONFIG_FLASH_JESD216_API,				\
				(.jedec_id = DT_INST_PROP(inst, jedec_id),))			\
		))									\
												\
		XSPI_DMA_CHANNEL(STM32_XSPI_NODE(inst), tx, TX, MEMORY, PERIPHERAL)		\
		XSPI_DMA_CHANNEL(STM32_XSPI_NODE(inst), rx, RX, PERIPHERAL, MEMORY)		\
	};											\
												\
	DEVICE_DT_INST_DEFINE(inst, &flash_stm32_xspi_init, NULL,				\
			      &flash_stm32_xspi_dev_data_##inst, &flash_stm32_xspi_cfg_##inst,	\
			      POST_KERNEL, CONFIG_FLASH_INIT_PRIORITY,				\
			      &flash_stm32_xspi_driver_api);

#define XSPI_STM32_INIT(inst)							\
	IF_ENABLED(DT_NODE_HAS_STATUS_OKAY(STM32_XSPI_NODE(inst)),		\
		   (XSPI_NOR_STM32_INIT(inst)))

DT_INST_FOREACH_STATUS_OKAY(XSPI_STM32_INIT)
